packages/inductiva/inductiva-0.3.0.tar.gz/inductiva-0.3.0/inductiva/templates/heat_sink/openfoam/files/constant/fins/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/metal";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    // Aluminium

    specie
    {
        molWeight       27;
    }
    equationOfState
    {
        rho             2712;
    }
    transport
    {
        kappa           240;
    }
    thermodynamics
    {
        Hf              0;
        Cv              896;
    }
}

// ************************************************************************* //
